<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2020/8/28 0028
 * Time: 下午 1:55
 */

//需要隐藏的权限路径
return [

    //针对独步展示
    'dubu' => [
        829   //不上报计划设置
    ],

    // 仅对海贝  快玩开放的权限
    'hide_menu'    => [
        4, 8, 9, 18, 35, 102, 195, 239, 243, 244, 294, 296, 297, 298,
        540, 541, 542, 543, 546, 547, 550, 551, 566, 811, 818, 819
    ],

    // 仅对快玩开放的权限
    'kuaiwan_menu' => [
        295, 535, 536, 539, 548, 552, 553, 561, 565,  //提成统计
        820,                                          //计划数统计
        568, 569, 570, 571, 572, 573, 574,            //投放书单
        821, 822, 823,                                //黑名单账户
        824, 825,                                     //计划统计和修改
        810                                          //设备统计
    ]
];